// 1. Створити змінну з іменем age і присвоїти їй значення свого віку.
  // Вивести значення цієї змінної в консоль.//

let age ='14 років'
console.log(age)

//2. Створити змінну з іменем name і присвоїти їй значення свого імені.
// Вивести значення цієї змінної в консоль.//
const myname = 'Мене звати Кіра'
 console.log(myname);
// 3. Створити змінну з іменем isStudent і присвоїти їй значення true або false, залежно від того, чи є студентом.
// Вивести значення цієї змінної в консоль.//
 let isStudent = Boolean(' false')
console.log(isStudent)

// 4. Створити змінну з іменем myString і присвоїти їй рядок з вашої улюбленою цитатою.
// Вивести цей рядок в консоль.//
let myString  ='Життя не має обмежень окрім тих які ми створюємо собі самі'
console.log(myString )

//5. Створити змінну з іменем myNumber і присвоїти їй довільне числове значення. Потім присвоїти цій змінній результат додавання до неї числа 10.
// Вивести значення myNumber в консоль.//

let myNumber = 100;
myNumber = myNumber + 10;

console.log( myNumber);

//6. Створити змінну з іменем myNull і присвоїти їй значення null.
// Вивести значення цієї змінної в консоль.//
let myNull = null;

console.log( myNull);


//7. Створити скрипт який виводить спливаюче вікно з запитом на введення імені користувача “Введіть своє ім’я” за допомогою prompt(). Результат зберегти в змінній userName. Після вивести alert з отриманим ім’ям. Також перевірити за допомогою 
//typeof тип змінної userName при отриманні імен. 

const userName = prompt("Будь ласка, введіть своє ім'я");


if (userName) {
    
   alert("Вітаю, " + userName );
}

console.log(userName);

const userAnswer = confirm("Ви дійсно хочете покинути сторінку?");
console.log(userAnswer)


//9. Створити скрипт який виводить спливаюче попередження "Увага! Дія може бути небезпечною." за допомогою alert(). Вивести повідомлення про те, що дія небезпечна та попросити користувача підтвердити дію за допомогою confirm()
// “Ви впевнені, що хочете продовжити?” Результат вивести в консоль//
const isConfirm ="Підтвердіть дію";
alert(isConfirm)
console.log(isConfirm);

const isShouldrennu =alert(" Увага! дія може бути небезпечна");
console.log(isShouldrennu  )

const isSure =confirm("Ви впевнені  що хочете продовжити");
console.log(isSure);








